**Name:** Mahendra Pratap Singh | **Reg ID:**  GO_STP_7372 | **Trainee at:** Goeduhub Technologies | **One hot encoding**

#### What is nominal variable:
**Nominal variable represent discrete units and are used to label variables, that have no quantitative value. Just think of them as "labels“. Note that nominal data that has no order. Therefore if you would change the order of its values, the meaning would not change.



#### What is ordinal variable:
Ordinal variable represent discrete and ordered units. It is therefore nearly the same as nominal data, except that it’s ordering matters.



#### Discuss about multi-collinearity and dummy variable:
A **dummy variable** is a variable that takes values of 0 and 1, where the values indicate the presence or absence of something for example: 0 may indicate a placebo and 1 may indicate a drug.Its also leads to the problem known as Multicollinearity.


In statistics, **multicollinearity** (also known as collinearity) is a phenomenon in which one predictor variable in a multiple regression model can be linearly predicted from the others with a substantial degree of accuracy. In this situation, the coefficient estimates of the multiple regression may change erratically in response to small changes in the model or the data. Multicollinearity does not reduce the predictive power or reliability of the model as a whole, at least within the sample data set; it only affects calculations regarding individual predictors.

In [45]:
from pandas import*
from numpy import*

In [44]:
data = read_table('salary.dat.txt')
data.head(2)

        sx        rk yr        dg yd    sl
0     male      full 25 doctorate 35 36350
1     male      full 13 doctorate 22 35350

In [76]:
data2 = read_table("salary.dat.txt",delim_whitespace=True)
data2.head()

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696

In [47]:
data2.shape

(52, 6)

In [48]:
data2.dtypes

sx    object
rk    object
yr     int64
dg    object
yd     int64
sl     int64
dtype: object

In [59]:
dummise = get_dummies(data2.sx)
dummise.head(2)

   female  male
0       0     1
1       0     1

In [64]:
merge = concat([data,dummise],axis='columns')
merge.head()

        sx        rk yr        dg yd    sl  female  male
0     male      full 25 doctorate 35 36350       0     1
1     male      full 13 doctorate 22 35350       0     1
2     male      full 10 doctorate 23 28200       0     1
3   female      full  7 doctorate 27 26775       1     0
4     male      full 19   masters 30 33696       0     1

In [66]:
dumm = get_dummies(data2.dg)
dumm.head()

   doctorate  masters
0          1        0
1          1        0
2          1        0
3          1        0
4          0        1

In [67]:
merge2 = concat([data,dumm],axis='columns')
merge2.head()

        sx        rk yr        dg yd    sl  doctorate  masters
0     male      full 25 doctorate 35 36350          1        0
1     male      full 13 doctorate 22 35350          1        0
2     male      full 10 doctorate 23 28200          1        0
3   female      full  7 doctorate 27 26775          1        0
4     male      full 19   masters 30 33696          0        1

#### One hot encoding

In [79]:
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder

from sklearn.compose import ColumnTransformer

le = LabelEncoder()

In [81]:
newdf = data2

In [82]:
newdf.sx = le.fit_transform(newdf.sx)
newdf.head()

   sx    rk  yr         dg  yd     sl
0   1  full  25  doctorate  35  36350
1   1  full  13  doctorate  22  35350
2   1  full  10  doctorate  23  28200
3   0  full   7  doctorate  27  26775
4   1  full  19    masters  30  33696

In [85]:
ct = ColumnTransformer([('sx',OneHotEncoder(),[3])],remainder='passthrough')

In [86]:
newct = ct.fit_transform(data2)

In [90]:
print(newct[:5])

[[1.0 0.0 1 'full' 25 35 36350]
 [1.0 0.0 1 'full' 13 22 35350]
 [1.0 0.0 1 'full' 10 23 28200]
 [1.0 0.0 0 'full' 7 27 26775]
 [0.0 1.0 1 'full' 19 30 33696]]